import React from 'react';
import Header from "../../components/Header";
import Footer from "../../components/Footer";

function Terms() {
    return (
        <div>
            <Header/>
            <div className="background">
                <div className="textField">
                    <h1>Політика Користування</h1>
                    <p>Ласкаво просимо на платформу краудфандингу "Добротвір". Використання нашого сайту регулюється
                        наступними правилами та умовами. Будь ласка, уважно ознайомтеся з ними перед використанням
                        нашого сервісу.</p>
                    <h2>1. Згода з Умовами</h2>
                    <p>Використовуючи наш сайт, ви погоджуєтеся дотримуватись цих умов. Якщо ви не погоджуєтеся з
                        будь-якою частиною цих умов, будь ласка, не використовуйте наш сайт.</p>
                    <h2>2. Реєстрація та Обліковий Запис</h2>
                    <ul style={{
                        display: "flex",
                        flexDirection: "column",
                        alignItems: "flex-start",
                        padding: "0",
                    }}>
                        <li>Для доступу до деяких функцій нашого сайту вам потрібно зареєструватися і створити
                            обліковий
                            запис.
                        </li>
                        <li>Ви погоджуєтеся надати точну, актуальну та повну інформацію
                            під час реєстрації та підтримувати її в актуальному стані.
                        </li>
                        <li>Ви несете відповідальність за збереження конфіденційності вашого пароля та облікового
                            запису, а також за всі дії, що здійснюються під вашим обліковим записом.
                        </li>
                    </ul>
                    <h2>3. Використання Сервісу</h2>
                    <ul style={{
                        display: "flex",
                        flexDirection: "column",
                        alignItems: "flex-start",
                        padding: "0",
                    }}>
                        <li>Ви погоджуєтеся використовувати наш сайт тільки для законних цілей і відповідно до цих
                            умов.
                        </li>
                        <li>Забороняється використовувати наш сайт для розповсюдження шкідливого програмного
                            забезпечення, спаму або іншої незаконної діяльності.
                        </li>
                        <li>Ви не повинні порушувати права інтелектуальної власності або інші права третіх осіб.
                        </li>
                    </ul>
                    <h2>4. Збір та Використання Коштів</h2>
                    <ul style={{
                        display: "flex",
                        flexDirection: "column",
                        alignItems: "flex-start",
                        padding: "0",
                    }}>
                        <li>Кошти, зібрані через нашу платформу, повинні використовуватись виключно для цілей,
                            зазначених у відповідних кампаніях.
                        </li>
                        <li>Ініціатори кампаній зобов'язані надавати точну інформацію про мету збору коштів та
                            звітувати
                            про їх використання.
                        </li>
                    </ul>
                </div>
            </div>
            <Footer/>
        </div>
    )
}

export default Terms;